---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_X
enum: Autodesk.Revit.DB.AdaptivePointConstraintType
source: html/9aa479aa-36be-bf1b-7570-026afcd4d02e.htm
---
# Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_X

Constrained to the X Axis (y=0, z=0).